Tekla Open API Reference for Tekla Structures 2025
PreferredSymbolPlacingTypes Methods
The PreferredSymbolPlacingTypes type exposes the following members.
Methods
Name | Description
AlongLinePlacingType
 The object is placed using the along line placing.
LeaderLinePlacingType
 The object is placed with a leader line.
PointPlacingType
 The object is placed at one point (the insertion point) without any additional placing options.
Top
See Also
Reference
PreferredSymbolPlacingTypes Class
Tekla.Structures.Drawing Namespace